<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Services</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.76.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="section" title="Services"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e2"></a>Services</h2></div></div><hr></div><p>   
        &#19968;&#20010;Service&#26159;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#65292;&#23427;&#33021;&#23436;&#25104;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#25805;&#20316;&#22312;&#21518;&#21488;&#65292;&#24182;&#19988;&#19981;&#25552;&#20379;&#29992;&#25143;&#25509;&#21475;&#12290;&#21478;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#33021;&#24320;&#21551;&#19968;&#20010;service&#24182;&#19988;&#23427;&#23558;&#32487;&#32493;&#36816;&#34892;&#22312;&#21518;&#21488;&#21363;&#20351;&#29992;&#25143;&#36716;&#25442;&#21040;&#21478;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#12290;&#39069;&#22806;&#30340;&#65292;&#19968;&#20010;&#32452;&#20214;&#21487;&#20197;&#34987;&#32465;&#23450;&#21040;&#19968;&#20010;service&#26469;&#21644;&#23427;&#20132;&#20114;&#29978;&#33267;&#23436;&#25104;&#36827;&#31243;&#38388;&#36890;&#20449;&#12290;&#20363;&#22914;&#65292;&#19968;&#20010;service&#21487;&#33021;&#25805;&#20316;&#32593;&#32476;&#24102;&#20260;&#12289;&#25773;&#25918;&#38899;&#20048;&#12289;&#25191;&#34892;I/O&#25110;&#21644;&#19968;&#20010;content
        provider&#20132;&#20114;&#65292;&#25152;&#26377;&#36825;&#20123;&#37117;&#26159;&#22312;&#21518;&#21488;&#36827;&#34892;&#12290; </p><p>    &#19968;&#20010;service&#20027;&#35201;&#26377;&#20004;&#20010;&#29992;&#36884;&#65306; </p><p> 1&#12289;Started </p><p>   
        &#19968;&#20010;service&#34987;&#24320;&#21551;&#24403;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#65288;&#20363;&#22914;activity&#65289;&#29992;startService()&#24320;&#21551;&#23427;&#12290;&#19968;&#26086;&#24320;&#21551;&#65292;&#19968;&#20010;service&#33021;&#26080;&#26399;&#38480;&#30340;&#36816;&#34892;&#22312;&#21518;&#21488;&#65292;&#21363;&#20351;&#21019;&#24314;&#23427;&#30340;&#32452;&#20214;&#34987;&#38144;&#27585;&#12290;&#36890;&#24120;&#65292;&#19968;&#20010;&#21551;&#21160;&#30340;service&#23436;&#25104;&#19968;&#20010;&#21333;&#30340;&#25805;&#20316;&#65292;&#24182;&#19988;&#19981;&#36820;&#22238;&#32467;&#26524;&#32473;&#35843;&#29992;&#32773;&#12290;&#20363;&#22914;&#65292;&#23427;&#21487;&#33021;&#19979;&#36733;&#34060;&#19978;&#20256;&#19968;&#20010;&#25991;&#20214;&#36890;&#36807;&#32593;&#32476;&#12290;&#24403;&#25805;&#20316;&#23436;&#25104;&#65292;&#26381;&#21153;&#24212;&#35813;&#20572;&#27490;&#23427;&#33258;&#24049;&#12290; </p><p> 2&#12289;Bound </p><p>    &#19968;&#20010;service&#22788;&#20110;Bound&#29366;&#24577;&#65292;&#24403;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#32465;&#23450;&#23427;&#36890;&#36807;bindService()&#12290;&#19968;&#20010;bound
        service&#25552;&#20379;&#19968;&#20010;&#23458;&#25143;&#31471;/&#26381;&#21153;&#22120;&#25509;&#21475;&#65292;&#20197;&#20801;&#35768;&#32452;&#20214;&#21644;service&#20132;&#20114;&#12289;&#21457;&#36865;&#35831;&#27714;&#12289;&#33719;&#21462;&#32467;&#26524;&#29978;&#33267;&#20570;&#36328;&#36827;&#31243;&#30340;&#36827;&#31243;&#38388;&#36890;&#20449;&#65288;IPC&#65289;&#12290;&#19968;&#20010;bound
        service&#36816;&#34892;&#21482;&#26377;&#24403;&#21478;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#32465;&#23450;&#23427;&#12290;&#26356;&#22810;&#30340;&#26159;&#65292;&#32452;&#20214;&#33021;&#19968;&#26086;&#32465;&#23450;&#21040;service&#65292;&#20294;&#24403;&#23427;&#20204;&#25152;&#26377;&#37117;&#21462;&#28040;&#32465;&#23450;&#65292;&#36825;&#20010;service&#23601;&#34987;&#25703;&#27585;&#12290;</p><p>
        &#34429;&#28982;&#36825;&#31687;&#25991;&#26723;&#20027;&#35201;&#21333;&#29420;&#22320;&#35752;&#35770;&#20004;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;service&#65292;&#20320;&#30340;service&#21487;&#20197;&#20004;&#20010;&#37117;&#24037;&#20316;&#65293;&#65293;&#23427;&#21487;&#20197;&#21551;&#21160;&#65288;&#26080;&#26399;&#38480;&#30340;&#36816;&#34892;&#65289;&#24182;&#19988;&#21516;&#26679;&#20801;&#35768;&#32465;&#23450;&#12290;&#36825;&#21482;&#26159;&#20320;&#30340;&#32452;&#20214;&#26159;&#21542;&#23454;&#29616;&#20102;&#20004;&#20010;onStartComamnd&#65288;&#65289;&#22238;&#35843;&#30340;&#38382;&#39064;&#65292;&#26469;&#20801;&#35768;&#32452;&#20214;&#21551;&#21160;&#23427;&#24182;&#19988;onBind()&#20801;&#35768;&#32465;&#23450;&#12290; </p><p>
          &#19981;&#31649;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#26159;&#21542;&#21551;&#21160;&#12289;bound&#12289;&#25110;&#20004;&#20010;&#37117;&#26159;&#65292;&#20219;&#20309;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#37117;&#21487;&#20197;&#20351;&#29992;service(&#29978;&#33267;&#20174;&#19968;&#20010;&#21333;&#29420;&#30340;&#24212;&#29992;&#31243;&#24207;)&#65292;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#65292;&#20219;&#20309;&#32452;&#20214;&#33021;&#20351;&#29992;&#19968;&#20010;activity&#65293;&#65293;&#36890;&#36807;&#19968;&#20010;Intent&#24320;&#21551;&#12290;&#21487;&#26159;&#65292;&#20320;&#33021;&#22768;&#26126;service&#31169;&#26377;&#65292;&#22312;manifest&#25991;&#20214;&#37324;&#65292;&#24182;&#19988;&#38459;&#27490;&#35775;&#38382;&#20174;&#20854;&#23427;&#24212;&#29992;&#31243;&#24207;&#12290; </p><p>    <span class="bold"><strong> &#35686;&#21578;</strong></span>
        &#65306;&#19968;&#20010;service&#25903;&#23427;&#30340;&#20027;&#36827;&#31243;&#30340;&#20027;&#32447;&#31243;&#65293;&#65293;service&#19981;&#21019;&#24314;&#23427;&#33258;&#24049;&#30340;&#32447;&#31243;&#24182;&#19988;&#19981;&#36816;&#34892;&#22312;&#21333;&#29420;&#30340;&#36827;&#31243;&#65288;&#38500;&#38750;&#20320;&#25351;&#23450;&#65289;&#12290;&#36825;&#24847;&#21619;&#30528;&#65292;&#22914;&#26524;&#20320;&#30340;service&#23558;&#35201;&#21435;&#20570;&#20219;&#20309;&#32791;CPU&#30340;&#24037;&#20316;&#25110;&#38459;&#22622;&#25805;&#20316;&#65288;&#20363;&#22914;MP3&#25773;&#25918;&#25110;&#32593;&#32476;&#65289;&#65292;&#20320;&#24212;&#35813;&#26032;&#24314;&#19968;&#20010;&#32447;&#31243;&#20026;&#36825;&#20010;service&#26469;&#23436;&#25104;&#37027;&#20010;&#24037;&#20316;&#12290;&#36890;&#36807;&#20351;&#29992;&#19968;&#20010;&#21333;&#29420;&#30340;&#32447;&#31243;&#65292;&#20320;&#23558;&#20943;&#23569;&#24212;&#29992;&#31243;&#24207;&#19981;&#21709;&#24212;&#65288;ANR&#65289;&#39118;&#38505;&#24182;&#19988;&#24212;&#29992;&#31243;&#24207;&#30340;&#20027;&#32447;&#31243;&#33021;&#19987;&#27880;&#20110;&#20320;&#30340;activity&#30340;&#29992;&#25143;&#20132;&#20114;&#12290; </p><div class="section" title="The Basics"><div class="titlepage"><div><div><h3 class="title"><a name="d0e26"></a>The Basics</h3></div></div></div><p>
              &#20026;&#20102;&#21019;&#24314;&#19968;&#20010;service&#65292;&#20320;&#24517;&#39035;&#21019;&#24314;&#19968;&#20010;service&#30340;&#23376;&#31867;&#65288;&#25110;&#24050;&#32463;&#23384;&#22312;&#31867;&#30340;&#23376;&#31867;&#65289;&#12290;&#22312;&#20320;&#30340;&#23454;&#29616;&#20013;&#65292;&#20320;&#38656;&#35201;&#38656;&#35201;&#35206;&#30422;&#19968;&#20123;&#22238;&#35843;&#20989;&#25968;&#65292;&#37027;&#20123;&#25805;&#20316;service&#29983;&#21629;&#21608;&#26399;&#20851;&#38190;&#26041;&#38754;&#24182;&#19988;&#32473;&#32452;&#20214;&#25552;&#20379;&#19968;&#20010;&#26426;&#21046;&#26469;&#32465;&#23450;&#21040;serivce&#65292;&#22914;&#26524;&#21512;&#36866;&#12290;&#26368;&#37325;&#35201;&#30340;&#22238;&#35843;&#20320;&#24212;&#35813;&#35206;&#30422;&#30340;&#26159;&#65306; </p><p>onStartCommand()</p><p>
              &#31995;&#32479;&#35843;&#36825;&#20010;&#26041;&#27861;&#24403;&#21478;&#19968;&#20010;&#32452;&#20214;&#65292;&#20363;&#22914;&#19968;&#20010;activity&#65292;&#35831;&#27714;&#21551;&#21160;&#36825;&#20010;service&#36890;&#36807;startService()&#12290;&#19968;&#26086;&#36825;&#20010;&#26041;&#27861;&#25191;&#34892;&#65292;&#36825;&#20010;service&#23558;&#21551;&#21160;&#24182;&#19988;&#26080;&#26399;&#38480;&#30340;&#36816;&#34892;&#22312;&#21518;&#21488;&#12290;&#22914;&#26524;&#20320;&#23454;&#29616;&#36825;&#20010;&#65292;&#37027;&#20040;&#20572;&#27490;service&#23601;&#26159;&#20320;&#30340;&#36131;&#20219;&#20102;&#24403;&#23427;&#30340;&#24037;&#20316;&#23436;&#25104;&#65292;&#36890;&#36807;&#35843;&#29992;stopSelf()&#25110;stopService()&#12290;&#65288;&#22914;&#26524;&#20320;&#21482;&#24076;&#26395;&#25552;&#20379;&#32465;&#23450;&#65292;&#20320;&#19981;&#38656;&#35201;&#23454;&#29616;&#36825;&#20010;&#26041;&#27861;&#65289; </p><p>onBind()</p><p>
              &#31995;&#32479;&#35843;&#29992;&#36825;&#20010;&#26041;&#27861;&#24403;&#21478;&#19968;&#20010;&#32452;&#20214;&#24076;&#26395;&#32465;&#23450;service(&#20363;&#22914;RPC)&#65292;&#36890;&#36807;bindService()&#12290;&#22312;&#20320;&#36825;&#20010;&#26041;&#27861;&#30340;&#23454;&#29616;&#20013;&#65292;&#20320;&#24517;&#39035;&#25552;&#20379;&#19968;&#20010;&#23458;&#25143;&#20351;&#29992;&#30340;&#26469;&#21644;&#36825;&#20010;service&#36890;&#20449;&#30340;&#25509;&#21475;&#65292;&#36890;&#36807;&#19968;&#20010;IBinder&#12290;&#20320;&#24517;&#39035;&#19968;&#30452;&#23454;&#29616;
            &#36825;&#20010;&#20989;&#25968;&#65292;&#20294;&#22914;&#26524;&#20320;&#19981;&#24076;&#26395;&#20801;&#35768;&#32465;&#23450;&#65292;&#37027;&#20040;&#20320;&#36820;&#22238;null&#12290; </p><p>onCreate()</p><p>
             
             &#31995;&#32479;&#35843;&#29992;&#36825;&#20010;&#26041;&#27861;&#24403;service&#31532;&#19968;&#27425;&#34987;&#21019;&#24314;&#65292;&#23454;&#29616;&#19968;&#27425;&#23433;&#35013;&#30340;&#27493;&#39588;&#65288;&#22312;&#23427;&#35843;onStartCommand()&#21644;onBind()&#20043;&#21069;&#65289;&#12290;&#22914;&#26524;service&#24050;&#32463;&#22312;&#36816;&#34892;&#65292;&#37027;&#20040;&#36825;&#20010;&#26041;&#27861;&#19981;&#20250;&#35843;&#29992;&#12290;</p><p>onDestroy()</p><p>    &#31995;&#32479;&#35843;&#29992;&#36825;&#20010;&#26041;&#27861;service&#19981;&#20877;&#20351;&#29992;&#23558;&#34987;&#25703;&#27585;&#12290;&#20320;&#30340;service&#24212;&#35813;&#23454;&#29616;&#36825;&#20010;&#26469;&#28165;&#29702;&#25152;&#26377;&#36164;&#28304;&#20363;&#22914;&#32447;&#31243;&#12289;&#27880;&#20876;&#30340;&#30417;&#21548;&#32773;&#12289;&#25509;&#25910;&#22120;&#31561;&#12290;&#36825;&#26159;service&#25509;&#25910;&#21040;&#30340;&#26368;&#21518;&#19968;&#20010;&#35843;&#29992;&#12290;</p><p>   &#22914;&#26524;&#19968;&#20010;&#32452;&#20214;&#21551;&#21160;&#19968;&#20010;service&#36890;&#36807;startService()&#65288;&#23548;&#33268;&#35843;&#29992;onStartCommand()&#65289;&#65292;&#28982;&#21518;&#36825;&#20010;service&#32500;&#25345;&#36816;&#34892;&#30452;&#21040;&#23427;&#20572;&#27490;&#23427;&#33258;&#24049;&#36890;&#36807;stopSelf()&#25110;&#21478;&#19968;&#20010;&#32452;&#20214;&#20572;&#27490;&#23427;&#36890;&#36807;stopService()&#12290;</p><p>  &#22914;&#26524;&#19968;&#20010;&#32452;&#20214;&#35843;&#29992;bindService()&#26469;&#21019;&#24314;service&#65288;onStartCommand()&#19981;&#34987;&#35843;&#29992;&#65289;&#65292;&#37027;&#20040;&#36825;&#20010;service&#24403;&#32452;&#20214;&#32465;&#23450;&#23427;&#30340;&#26102;&#20505;&#36816;&#34892;&#12290;&#19968;&#37327;service&#34987;&#21462;&#28040;&#32465;&#23450;&#20174;&#23458;&#25143;&#65292;&#31995;&#32479;&#38144;&#27585;&#23427;&#12290;</p><p>  Android&#31995;&#32479;&#23558;&#24378;&#21046;&#20572;&#27490;&#19968;&#20010;service&#21482;&#26377;&#24403;&#20869;&#23384;&#24456;&#20302;&#24182;&#19988;&#23427;&#24517;&#39035;&#24674;&#22797;&#31995;&#32479;&#36164;&#28304;&#20026;&#25317;&#26377;&#29992;&#25143;&#28966;&#28857;&#30340;activity&#12290;&#22914;&#26524;service&#32465;&#23450;&#21040;&#19968;&#20010;&#25317;&#26377;&#29992;&#25143;&#28966;&#28857;&#30340;activity&#65292;&#37027;&#20040;&#23427;&#19981;&#22826;&#21487;&#33021;&#34987;&#26432;&#65292;&#22914;&#26524;service&#34987;&#22768;&#26126;&#20026;&#36816;&#34892;&#22312;&#21069;&#21488;&#65288;&#31245;&#21518;&#35752;&#35770;&#65289;&#65292;&#37027;&#20040; &#23427;&#23558;&#20960;&#20046;&#27704;&#36828;&#19981;&#20250;&#34987;&#26432;&#12290;&#21542;&#21017;&#65292;&#22914;&#26524;service&#21551;&#21160;&#65292;&#24182;&#19988;&#19968;&#30452;&#36816;&#34892;&#65292;&#37027;&#20040; &#31995;&#32479;&#20250;&#38477;&#20302;&#23427;&#30340;&#20301;&#32622;&#22312;&#21518;&#21488;&#20219;&#20309;&#21015;&#34920;&#37324;&#38543;&#30528;&#26102;&#38388;&#65292;&#24182;&#19988;service&#23558;&#21464;&#24471;&#39640;&#24230;&#34987;&#26432;&#65293;&#65293;&#22914;&#26524;&#20320;&#30340;service&#19968;&#24180;&#38750;&#24120;&#65292;&#37027;&#20040;&#20320;&#24517;&#39035;&#35774;&#35745;&#23427;&#28201;&#26580;&#30340;&#34987;&#31995;&#32479;&#37325;&#21551;&#12290;&#22914;&#26524;&#31995;&#32479;&#26432;&#27515;&#20320;&#30340;service&#65292;&#23427;&#37325;&#21551;&#23427;&#19968;&#37327;&#36164;&#28304;&#21464;&#24471;&#21487;&#21033;&#29992;&#65288;&#34429;&#28982;&#36825;&#20010;&#20063;&#20381;&#36182;&#20110;&#20320;&#20174;onStartCommand&#36820;&#22238;&#30340;&#20540;&#65289;&#12290;</p></div><div class="section" title="Declaring a service in the manifest"><div class="titlepage"><div><div><h3 class="title"><a name="d0e53"></a>Declaring a service in the manifest</h3></div></div></div><p>    &#20687;&#24456;&#22810;activities&#65288;&#20197;&#21450;&#20854;&#23427;&#32452;&#20214;&#65289;&#65292;&#20320;&#24517;&#39035;&#22768;&#26126;&#25152;&#26377;&#30340;services&#22312;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;manifest&#25991;&#20214;&#37324;&#12290;
        &#20026;&#20102;&#22768;&#26126;&#20320;&#30340;&#26381;&#21153;&#65292;&#21152;&#20837;&lt;service&gt;&#20803;&#32032;&#20316;&#20026;&lt;application&gt;&#20803;&#32032;&#30340;&#23376;&#20803;&#32032;&#12290;&#20363;&#22914;&#65306;</p><div class="mediaobject"><img src="images/android-12.png"></div><p>  
             &#26377;&#20854;&#23427;&#30340;&#23646;&#24615;&#20320;&#21487;&#20197;&#22312;&lt;service&gt;&#20803;&#32032;&#20013;&#26469;&#23450;&#20041;&#23646;&#24615;&#65292;&#20363;&#22914;&#21551;&#21160;service&#30340;&#26435;&#38480;&#21644;service&#36816;&#34892;&#22312;&#21738;&#19968;&#20010;&#36827;&#31243;&#12290;</p><p>    &#23601;&#20687;&#19968;&#20010;activity&#65292;&#19968;&#20010;&#26381;&#21153;&#21487;&#20197;&#23450;&#20041;intent filters&#26469;&#20801;&#35768;&#20854;&#23427;&#32452;&#20214;&#28608;&#27963;&#26381;&#21153;&#20351;&#29992;&#38544;&#21547;&#30340;intent&#12290;&#36890;&#36807;&#22768;&#26126;intent
            filters&#65292;&#20219;&#20309;&#20854;&#23427;&#24212;&#29992;&#31243;&#24207;&#30340;&#32452;&#20214;&#21551;&#21160;&#20320;&#30340;service&#22914;&#26524;&#20320;&#30340;service&#22768;&#26126;&#19968;&#20010;intent
            filter&#65292;&#21305;&#37197;&#20854;&#23427;&#24212;&#29992;&#31243;&#24207;&#20256;&#36882;&#32473;startService()&#30340;intent&#12290; </p><p>     &#22914;&#26524;&#20320;&#35745;&#21010;&#21482;&#26412;&#22320;&#20351;&#29992;&#20320;&#30340;service(&#20854;&#23427;&#24212;&#29992;&#31243;&#24207;&#30475;&#19981;&#35265;)&#65292;&#37027;&#20040;&#20320;&#19981;&#38656;&#35201;&#65288;&#20063;&#19981;&#24212;&#35813;&#65289;&#25552;&#20379;&#20219;&#20309;intent
            filters&#12290;&#27809;&#26377;&#20219;&#20309;intent filters&#65292;&#20320;&#24517;&#39035;&#21551;&#21160;&#36825;&#20010;service&#20351;&#29992;&#19968;&#20010;intent&#65292;&#26174;&#24335;&#30340;&#21629;&#21517;service&#31867;&#12290; </p></div></div></body></html>